//Нахождение интеграла методом прямоугольников с использование процедур. 
#include "stdafx.h" 
#include <iostream> 
#include <math.h> 
using namespace std;
void main()
{
	double h, S, x, a, b;
	int i, n;
	double f[1000];
	a = 1;  //Отрезок интегрирования а;
	b = 3;  //Отрезок интегрирования b;
	n = 512; //Количество разбиения отрезка(n<f); 16=1.18, 32=1.15 64=1.13 128=1.12 256=1.11
	x = 0;
	h = (b - a) / (float)n; //Длина каждой части отрезка;
	S = 0; //Площадь фигуры, т.е. значение нашего интеграла;
	for (i = 0; i <= n; i++)
	{
		x = a + i*h;
		f[i] = (sin(0.1) / cos(0.1))* (x * x + sqrt((1 + 0.2 * x))); //Находим значение интеграла;
		S = S + f[i];
	}
	S = h*S;
	cout << S; //Выводим ответ.
	system("PAUSE");
}

